<?php

return [
    'buttons' => [
        'colorize' => [
            'label' => 'Раскрасить',
        ],
    ],
    'window' => [
        'title' => 'Раскрасьте строки таблицы по своим условиям',
        'submit' => 'Применить',
    ],
    'fields' => [
        'target' => [
            'label' => 'Условие'
        ],
        'source_column' => [
            'label' => 'Исходный столбец'
        ],
        'operator' => [
            'label' => 'Оператор',
            'options' => [
                '=' => 'Равен',
                '!=' => 'Отличен',
                '>' => 'Больше',
                '>=' => 'Больше либо равен',
                '<' => 'Меньше',
                '<=' => 'Меньше либо равен',
            ]
        ],
        'column' => [
            'label' => 'Целевой столбец'
        ],
        'value' => [
            'label' => 'Значение'
        ],
        'color' => [
            'label' => 'Цвет'
        ],
    ]
];
